app/views/bookings/_form.html.erb

          <br>
          <%= f.select :user_id, options_from_collection_for_select(User.all, "id", "fname"), :include_blank => "-- Select One --" %>
---
SELECT "users".* FROM "users"

          <br>
          <%= f.select :restaurant_id, options_from_collection_for_select(Restaurant.all, "id", "name"), :include_blank => "-- Select One --" %>
---
SELECT "restaurants".* FROM "restaurants"