app/views/bookings/show.html.erb


<% if @booking.restaurant.present? %>
---
SELECT  "restaurants".* FROM "restaurants"  WHERE "restaurants"."id" = ? LIMIT 1  [["id", 8]]