app/controllers/bookings_controller.rb

  def create
    bookings = []
    @booking = Booking.new(booking_params)
    @booking.bdateMade = Date.today();
    @booking.numofpeople = params[:booking][:numofpeople].to_i

    restaurant = Restaurant.find(params[:booking][:restaurant_id]) if params[:booking][:restaurant_id].present?
    if restaurant.present?
    bookings = restaurant.bookings.where(:bstime => params[:booking][:bstime], :beventdate => params[:booking][:beventdate].to_date)
    end

    total_people = 0
    bookings.each do |b|
      total_people = total_people + b.numofpeople
    end
    total_people = total_people + @booking.numofpeople
    # you even don't need bdateMade when you have created_at available. Why don't you use it?
    if bookings.count < 4 && total_people <= 20
      respond_to do |format|
        if @booking.save
---
SELECT  "restaurants".* FROM "restaurants"  WHERE "restaurants"."id" = ? LIMIT 1  [["id", 3]]
SELECT "bookings".* FROM "bookings"  WHERE "bookings"."restaurant_id" = ? AND "bookings"."bstime" = 8 AND "bookings"."beventdate" = '2015-03-07'  [["restaurant_id", 3]]
SELECT COUNT(*) FROM "bookings"  WHERE "bookings"."restaurant_id" = ? AND "bookings"."bstime" = 8 AND "bookings"."beventdate" = '2015-02-04'  [["restaurant_id", 3]]
INSERT INTO "bookings" ("bdateMade", "beventdate", "beventtype", "bstime", "created_at", "numofpeople", "restaurant_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

    def set_booking
      @booking = Booking.find(params[:id])
---
SELECT  "bookings".* FROM "bookings"  WHERE "bookings"."id" = ? LIMIT 1  [["id", 27]]