app/controllers/items_controller.rb

  def index
    if params[:search]
      @items = Item.search(params[:search]).order("created_at DESC")
---
SELECT "items".* FROM "items"   ORDER BY created_at DESC

  def show
    @item = Item.find(params[:id]) if params[:id].present?
---
SELECT  "items".* FROM "items"  WHERE "items"."id" = ? LIMIT 1  [["id", 23]]

  def create
    @item = Item.new(item_params)

    respond_to do |format|
      if @item.save
---
INSERT INTO "items" ("created_at", "lowprice", "name", "picture", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", "2015-04-04 16:58:03.941580"], ["lowprice", 300], ["name", "Dr dre Beats"], ["picture", "beats.jpg"], ["updated_at", "2015-04-04 16:58:03.941580"]]