app/controllers/sessions_controller.rb

  def create
    user = User.find_by_fname(params[:fname])
---
SELECT  "users".* FROM "users"  WHERE "users"."fname" = 'admin' LIMIT 1