app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    role = Role.where(:title => "user").first

    respond_to do |format|
      if @user.save
        UserMailer.registration_confirmation(@user).deliver
        @user.role = role if role.present?
---
SELECT  "roles".* FROM "roles"  WHERE "roles"."title" = 'user'  ORDER BY "roles"."id" ASC LIMIT 1
INSERT INTO "role_users" ("created_at", "role_id", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", "2015-03-05 14:09:36.827533"], ["role_id", 12], ["updated_at", "2015-03-05 14:09:36.827533"], ["user_id", 20]]
INSERT INTO "users" ("confirm_token", "created_at", "dob", "email", "fname", "gender", "lname", "number", "password_digest", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT  "role_users".* FROM "role_users"  WHERE "role_users"."user_id" = ? LIMIT 1  [["user_id", 20]]

  def destroy
    @user = User.find(params[:id])
    @user.destroy()
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 23]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 23]]

 def confirm_email
    user = User.find_by_confirm_token(params[:confirm_email])
---
SELECT  "users".* FROM "users"  WHERE "users"."confirm_token" = '23' LIMIT 1